reddit_on_rails/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id") VALUES ($1, $2, $3) RETURNING "id"  [["content", "i love apples\r\n"], ["user_id", 1], ["post_id", 1]]