reddit_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    if @post.save!
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "App Academy"], ["url", "hello"], ["content", "i love coding"], ["user_id", 4], ["created_at", "2018-09-18 22:01:46.325978"], ["updated_at", "2018-09-18 22:01:46.325978"]]

  def update
    @post = current_user.posts.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 9], ["LIMIT", 1]]