reddit_on_rails/app/controllers/subs_controller.rb

  def update
    @sub = current_user.subs.find(params[:id])
---
SELECT "subs"."id" FROM "subs" WHERE "subs"."user_id" = $1  [["user_id", 1]]