reddit_on_rails/app/views/posts/edit.html.erb

SELECT "subs".* FROM "subs"
---
  </label>
  <% Sub.all.each do |sub| %>

SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 6]]
---
      <input type="checkbox" name="post[sub_ids][]" value="<%= sub.id %>"
      <%= "checked" if @post.sub_ids.include?(sub.id) %>> <%= sub.title %>