reddit_on_rails/app/views/posts/new.html.erb

  </label>
  <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"