reddit_on_rails/app/views/posts/show.html.erb

<ul>
  <% @post.subs.each do |sub| %>
---
SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 3]]